{
  "backend/main.mo": "Main Motoko actor defining Story type with 7 genres, storing stories in a Map, providing CRUD operations (createStory, getStory, listAllStories, filterStoriesByGenre), and pre-populating AI-generated stories for each genre on preupgrade.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: story browsing interface with genre navigation, story creation form, story reading view with text-to-speech, and literary-themed UI design with warm colors.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality, including pages, components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space with warm amber/brown/cream palette for a literary aesthetic.",
  "frontend/index.html": "HTML entry point with root div and module script import for the React application titled 'Story Hub'.",
  "frontend/src/App.tsx": "TanStack Router configuration defining root route with Layout wrapper and child routes for home (/), browse (/browse), create (/create), and read story (/story/$title) pages.",
  "frontend/src/components/GenreNav.tsx": "Genre navigation tabs component displaying all 7 genres with icons, handling genre selection state and triggering callbacks on genre change.",
  "frontend/src/components/Layout.tsx": "Application layout wrapper with sticky header containing logo and navigation buttons (Browse, Create), main content area, and footer with Caffeine.ai attribution.",
  "frontend/src/components/StoryCard.tsx": "Clickable story card component displaying title, author, genre badge, creation date, AI-generated indicator, and content preview with navigation to full story view.",
  "frontend/src/components/TextToSpeechControls.tsx": "Text-to-speech control panel with play/pause/stop buttons and status indicator for managing audio playback of story content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, creating auth clients with configurable options, and handling identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations including filtering stories by genre, fetching individual stories, listing all stories, and creating new stories with automatic cache invalidation.",
  "frontend/src/hooks/useTextToSpeech.tsx": "Custom hook that wraps the Web Speech API to provide text-to-speech functionality with play, pause, stop controls and state management for playing/paused status.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using CSS variables for light/dark themes, featuring warm literary colors (amber/orange tones) and custom font imports (Crimson Text and Inter).",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to handle conditional CSS class names with proper Tailwind class merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BrowseStories.tsx": "Page component for browsing stories with genre filtering, displaying a genre navigation bar and grid of story cards with loading states.",
  "frontend/src/pages/CreateStory.tsx": "Form page for creating new stories with fields for title, author, genre selection, and content textarea, using mutations to submit stories and navigate on success.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section showcasing the Story Hub platform, featuring navigation buttons to browse/create stories and a features section highlighting seven genres and platform capabilities.",
  "frontend/src/pages/ReadStory.tsx": "Story reading page component that displays full story content with metadata (title, author, genre, date), includes text-to-speech controls for audio playback, and provides navigation back to browse page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme with OKLCH color system, custom fonts (Inter, Crimson Text), extended color palette for UI components, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a story creation/sharing platform with AI-generated stories across seven genres, text-to-speech functionality, and tracking existing features plus pending feature requests for backend data models and story management."
}